Just noting that the latest changes here work correctly with Terraform now since the API is returning the correct results.

```
> terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  + create

Terraform will perform the following actions:

  # oxide_project.example will be created
  + resource "oxide_project" "example" {
      + description   = "example"
      + id            = (known after apply)
      + name          = "example"
      + time_created  = (known after apply)
      + time_modified = (known after apply)
    }

  # oxide_switch_port_settings.example will be created
  + resource "oxide_switch_port_settings" "example" {
      + addresses     = [
          + {
              + addresses = [
                  + {
                      + address        = "0.0.0.0/0"
                      + address_lot_id = "64ffed7d-c9e5-4456-8880-72ce52068ecc"
                    },
                ]
              + link_name = "phy0"
            },
        ]
      + description   = "example"
      + id            = (known after apply)
      + links         = [
          + {
              + autoneg   = false
              + link_name = "phy0"
              + lldp      = {
                  + enabled = true
                }
              + mtu       = 1500
              + speed     = "speed1_g"
            },
          + {
              + autoneg   = false
              + link_name = "phy1"
              + lldp      = {
                  + enabled = true
                }
              + mtu       = 1500
              + speed     = "speed1_g"
            },
        ]
      + name          = "example"
      + port_config   = {
          + geometry = "qsfp28x1"
        }
      + routes        = [
          + {
              + link_name = "phy0"
              + routes    = [
                  + {
                      + dst = "0.0.0.0/0"
                      + gw  = "0.0.0.0"
                    },
                ]
            },
        ]
      + time_created  = (known after apply)
      + time_modified = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

oxide_project.example: Creating...
oxide_switch_port_settings.example: Creating...
oxide_switch_port_settings.example: Creation complete after 0s [id=ad3dc048-39c0-4089-a4da-5ca6c5354212]
oxide_project.example: Creation complete after 1s [id=9ff9aac3-d613-4a05-a40c-84d7d6b2678c]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
~/o/t/tf ((00555be5))> terraform plan
oxide_project.example: Refreshing state... [id=9ff9aac3-d613-4a05-a40c-84d7d6b2678c]
oxide_switch_port_settings.example: Refreshing state... [id=ad3dc048-39c0-4089-a4da-5ca6c5354212]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.
```